#### Types of SQL Joins

1. **INNER JOIN**: Retrieves records with matching values in both tables.
2. **LEFT JOIN (LEFT OUTER JOIN)**: Retrieves all records from the left table and matching records from the right table. Non-matching records from the right table result in NULL.
3. **RIGHT JOIN (RIGHT OUTER JOIN)**: Retrieves all records from the right table and matching records from the left table. Non-matching records from the left table result in NULL.
4. **FULL JOIN (FULL OUTER JOIN)**: Retrieves all records from both tables, with NULLs where there is no match in either table.
5. **CROSS JOIN**: Combines all rows from both tables, resulting in a Cartesian product.
6. **SELF JOIN**: Joins a table to itself using aliases to compare rows within the same table.

To explain joins, we'll create two tables: **Employees 3** and **Departments**.

TABLE 1: Employees

| employee_id | first_name | last_name | department_id |
|-------------|------------|-----------|---------------|
| 1           | Rahul      | Sharma    | 101           |
| 2           | Priya      | Mehta     | 102           |
| 3           | Ankit      | Verma     | 103           |
| 4           | Simran     | Kaur      | NULL          |
| 5           | Aman       | Singh     | 101           |
| 6           | Gaurav     | Gupta     | 108           |

TABLE 2: Departments

| department_id | department_name |
|---------------|-----------------|
| 101           | Sales           |
| 102           | Marketing       |
| 103           | IT              |
| 104           | HR              |
| 105           | Management      |
| 107           | Finance         |
| 108           | CEO             |

In [1]:
%load_ext sql
%sql postgresql://admin:admin@db:5432/testdb

Connecting to 'postgresql://admin:***@db:5432/testdb'

In [2]:
%%sql
DROP TABLE IF EXISTS Employees3;

Running query in 'postgresql://admin:***@db:5432/testdb'

++
||
++
++

In [4]:
%%sql
CREATE TABLE IF NOT EXISTS Employees3 (
    employee_id SERIAL PRIMARY KEY,
    first_name VARCHAR(50),
    last_name VARCHAR(50),
    department_id INT
);

Running query in 'postgresql://admin:***@db:5432/testdb'

++
||
++
++

In [6]:
%%sql
INSERT INTO Employees3 (first_name, last_name, department_id) VALUES
('Rahul', 'Sharma', 101),
('Priya', 'Mehta', 102),
('Ankit', 'Verma', 103),
('Simran', 'Kaur', NULL),
('Aman', 'Singh', 101),
('Gaurav', 'Gupta', 108);

Running query in 'postgresql://admin:***@db:5432/testdb'

6 rows affected.

++
||
++
++

In [7]:
%%sql
SELECT * FROM Employees3;

Running query in 'postgresql://admin:***@db:5432/testdb'

6 rows affected.

+-------------+------------+-----------+---------------+
| employee_id | first_name | last_name | department_id |
+-------------+------------+-----------+---------------+
|      1      |   Rahul    |   Sharma  |      101      |
|      2      |   Priya    |   Mehta   |      102      |
|      3      |   Ankit    |   Verma   |      103      |
|      4      |   Simran   |    Kaur   |      None     |
|      5      |    Aman    |   Singh   |      101      |
|      6      |   Gaurav   |   Gupta   |      108      |
+-------------+------------+-----------+---------------+

In [8]:
%%sql
CREATE TABLE Departments (
    department_id INT PRIMARY KEY,
    department_name VARCHAR(50)
);

Running query in 'postgresql://admin:***@db:5432/testdb'

++
||
++
++

In [9]:
%%sql
INSERT INTO Departments (department_id, department_name) VALUES
(101, 'Sales'),
(102, 'Marketing'),
(103, 'IT'),
(104, 'HR'),
(105, 'Management'),
(107, 'Finance'),
(108, 'CEO');

Running query in 'postgresql://admin:***@db:5432/testdb'

7 rows affected.

++
||
++
++

In [10]:
%%sql
SELECT * FROM Departments;

Running query in 'postgresql://admin:***@db:5432/testdb'

7 rows affected.

+---------------+-----------------+
| department_id | department_name |
+---------------+-----------------+
|      101      |      Sales      |
|      102      |    Marketing    |
|      103      |        IT       |
|      104      |        HR       |
|      105      |    Management   |
|      107      |     Finance     |
|      108      |       CEO       |
+---------------+-----------------+

#### 1. INNER JOIN - Retrieve Employees3 and their department names where a **match exists**.

![Inner Join](https://learnsql.com/blog/sql-joins/sql-joins-venn-diagrams-inner-join.png)

In [12]:
%%sql
SELECT
    e.employee_id,
    e.first_name,
    e.last_name,
    d.department_name as department
FROM
    Employees3 e
INNER JOIN
    Departments d
ON
    e.department_id = d.department_id;

Running query in 'postgresql://admin:***@db:5432/testdb'

5 rows affected.

+-------------+------------+-----------+------------+
| employee_id | first_name | last_name | department |
+-------------+------------+-----------+------------+
|      1      |   Rahul    |   Sharma  |   Sales    |
|      2      |   Priya    |   Mehta   | Marketing  |
|      3      |   Ankit    |   Verma   |     IT     |
|      5      |    Aman    |   Singh   |   Sales    |
|      6      |   Gaurav   |   Gupta   |    CEO     |
+-------------+------------+-----------+------------+

#### 2. LEFT JOIN - Retrieve all Employees3 and their department names, including those without a department.

![Left Join](https://www.tutorialrepublic.com/lib/images/left-join.png)

We want all the data from Employees3 Table but only want those data from Department which match with employees_department_id

In [15]:
%%sql
SELECT
    e.employee_id,
    e.first_name,
    e.last_name,
    e.department_id,
    d.department_name as department
FROM
    Employees3 e
LEFT JOIN
    Departments d
ON
    e.department_id = d.department_id;

Running query in 'postgresql://admin:***@db:5432/testdb'

6 rows affected.

+-------------+------------+-----------+---------------+------------+
| employee_id | first_name | last_name | department_id | department |
+-------------+------------+-----------+---------------+------------+
|      1      |   Rahul    |   Sharma  |      101      |   Sales    |
|      2      |   Priya    |   Mehta   |      102      | Marketing  |
|      3      |   Ankit    |   Verma   |      103      |     IT     |
|      4      |   Simran   |    Kaur   |      None     |    None    |
|      5      |    Aman    |   Singh   |      101      |   Sales    |
|      6      |   Gaurav   |   Gupta   |      108      |    CEO     |
+-------------+------------+-----------+---------------+------------+

Above table we have all the employees and their department_id, Simran Kaur has no department hence not found in the Department table so that's why department table doesn't return that, but we still show all the employees data

#### 3. RIGHT JOIN - Retrieve all departments and the Employees3 working in them, including departments without

![Right Join](https://www.tutorialrepublic.com/lib/images/right-join.png)

We want all the data from Departments Table and it also show those employees who doesn't belongs to any of those departments

In [16]:
%%sql
SELECT
    e.employee_id,
    e.first_name,
    e.last_name,
    e.department_id,
    d.department_name as department
FROM
    Employees3 e
RIGHT JOIN
    Departments d
ON
    e.department_id = d.department_id;

Running query in 'postgresql://admin:***@db:5432/testdb'

8 rows affected.

+-------------+------------+-----------+---------------+------------+
| employee_id | first_name | last_name | department_id | department |
+-------------+------------+-----------+---------------+------------+
|      1      |   Rahul    |   Sharma  |      101      |   Sales    |
|      2      |   Priya    |   Mehta   |      102      | Marketing  |
|      3      |   Ankit    |   Verma   |      103      |     IT     |
|      5      |    Aman    |   Singh   |      101      |   Sales    |
|      6      |   Gaurav   |   Gupta   |      108      |    CEO     |
|     None    |    None    |    None   |      None     |     HR     |
|     None    |    None    |    None   |      None     |  Finance   |
|     None    |    None    |    None   |      None     | Management |
+-------------+------------+-----------+---------------+------------+

Above table we have all the departments, it also shows all the other department even if they are not linked with any employee

#### 4. FULL OUTER JOIN - Retrieve all Employees3 and departments, including non-matching records from both tables

![Full Outer Join](https://red9.com/wp-content/uploads/2025/05/full-outer-join-red9.png)

In [17]:
%%sql
SELECT
    e.employee_id,
    e.first_name,
    e.last_name,
    e.department_id,
    d.department_name as department
FROM
    Employees3 e
FULL OUTER JOIN
    Departments d
ON
    e.department_id = d.department_id;

Running query in 'postgresql://admin:***@db:5432/testdb'

9 rows affected.

+-------------+------------+-----------+---------------+------------+
| employee_id | first_name | last_name | department_id | department |
+-------------+------------+-----------+---------------+------------+
|      1      |   Rahul    |   Sharma  |      101      |   Sales    |
|      2      |   Priya    |   Mehta   |      102      | Marketing  |
|      3      |   Ankit    |   Verma   |      103      |     IT     |
|      4      |   Simran   |    Kaur   |      None     |    None    |
|      5      |    Aman    |   Singh   |      101      |   Sales    |
|      6      |   Gaurav   |   Gupta   |      108      |    CEO     |
|     None    |    None    |    None   |      None     |     HR     |
|     None    |    None    |    None   |      None     |  Finance   |
|     None    |    None    |    None   |      None     | Management |
+-------------+------------+-----------+---------------+------------+

#### 5. CROSS JOIN - Retrieves all possible combinations of Employees3 and departments.

![Cross Join](https://www.tutorialrepublic.com/lib/images/cross-join.png)

In [19]:
%%sql
SELECT
    e.employee_id,
    e.first_name,
    e.last_name,
    e.department_id,
    d.department_name as department
FROM
    Employees3 e
CROSS JOIN
    Departments d;

Running query in 'postgresql://admin:***@db:5432/testdb'

42 rows affected.

+-------------+------------+-----------+---------------+------------+
| employee_id | first_name | last_name | department_id | department |
+-------------+------------+-----------+---------------+------------+
|      1      |   Rahul    |   Sharma  |      101      |   Sales    |
|      2      |   Priya    |   Mehta   |      102      |   Sales    |
|      3      |   Ankit    |   Verma   |      103      |   Sales    |
|      4      |   Simran   |    Kaur   |      None     |   Sales    |
|      5      |    Aman    |   Singh   |      101      |   Sales    |
|      6      |   Gaurav   |   Gupta   |      108      |   Sales    |
|      1      |   Rahul    |   Sharma  |      101      | Marketing  |
|      2      |   Priya    |   Mehta   |      102      | Marketing  |
|      3      |   Ankit    |   Verma   |      103      | Marketing  |
|      4      |   Simran   |    Kaur   |      None     | Marketing  |
+-------------+------------+-----------+---------------+------------+
Truncated to displaylimit of 10.

#### 6. SELF JOIN - Find Employees3 who share the same department.

![Self Join](https://lets-viz.com/wp-content/uploads/2022/07/VENN-DIAGRAM-SELF-JOIN.png)

In [24]:
%%sql
SELECT
    e1.first_name AS employee1,
    e2.first_name AS employee2,
    d.department_name as department,
    dd.department_id as id
FROM
    Employees3 e1
JOIN
    Employees3 e2
ON
    e1.department_id = e2.department_id AND e1.employee_id != e2.employee_id
JOIN
    Departments d
ON
    e1.department_id = d.department_id
JOIN
    Departments dd
ON
    e1.department_id = dd.department_id;

Running query in 'postgresql://admin:***@db:5432/testdb'

2 rows affected.

+-----------+-----------+------------+-----+
| employee1 | employee2 | department |  id |
+-----------+-----------+------------+-----+
|   Rahul   |    Aman   |   Sales    | 101 |
|    Aman   |   Rahul   |   Sales    | 101 |
+-----------+-----------+------------+-----+

In [25]:
%%sql
SELECT
    e1.first_name AS employee1,
    e2.first_name AS employee2,
    d.department_name as department
FROM
    Employees3 e1
JOIN
    Employees3 e2
ON
    e1.department_id = e2.department_id AND e1.employee_id != e2.employee_id
JOIN
    Departments d
ON
    e1.department_id = d.department_id;

Running query in 'postgresql://admin:***@db:5432/testdb'

2 rows affected.

+-----------+-----------+------------+
| employee1 | employee2 | department |
+-----------+-----------+------------+
|   Rahul   |    Aman   |   Sales    |
|    Aman   |   Rahul   |   Sales    |
+-----------+-----------+------------+